---
type: RenderingQualitySettings
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# RenderingQualitySettings

`Autodesk.Revit.DB.RenderingQualitySettings` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsCustomQuality | 2017 | `public bool IsCustomQuality ()` |
| Method | IsValidRenderLevel | 2017 | `public bool IsValidRenderLevel ( int value )` |
| Method | IsValidRenderTime | 2017 | `public bool IsValidRenderTime ( int value )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LightAndMaterialAccuracyMode | 2017 | `public LightAndMaterialAccuracyMode LightAndMaterialAccuracyMode { get ; set ; }` |
| Property | RenderDuration | 2017 | `public RenderDuration RenderDuration { get ; set ; }` |
| Property | RenderLevel | 2017 | `public int RenderLevel { get ; set ; }` |
| Property | RenderTime | 2017 | `public int RenderTime { get ; set ; }` |
| Property | RenderingQuality | — | `public RenderingQuality RenderingQuality { get ; set ; }` |